= Annex B (informative) GeoSPARQL Examples

== B.1 RDF Examples

This Section illustrates GeoSPARQL ontology modelling with extended examples.

_New Features checklist - to be removed when all examples are complete:_

|===
|New element | Section

2+|_Classes_
|Spatial Measure class | <<Class: geo:SpatialMeasure>>
|===

=== B.1.1 Classes

==== B 1.1.1 `SpatialObject`
The `SpatialObject` class is defined in <<Class: geo:SpatialObject>>.

Basic use (as per the example in the class definition)

```turtle
eg:x a geo:SpatialObject ;
    skos:prefLabel "Object X";
.
```

NOTE: It is unlikely that users of GeoSPARQL will create many instances of `geo:SpatialObject` as its two more concrete subclasses, `geo:Feature` & `geo:Geometry`, are more directly relatable to real-world phenomena and use.

==== B 1.1.2 `Feature`
The `Feature` class is defined in <<Class: geo:Feature>>.

===== B 1.1.2.1 Basic use

```turtle
eg:x a geo:Feature ;
    skos:prefLabel "Feature X";
.
```

Here a `Feature` is declared and given a preferred label.

===== B 1.1.2.2 A `Feature` related to a `Geometry`

```turtle
eg:x a geo:Feature ;
    skos:prefLabel "Feature X";
    geo:hasGeometry [
        geo:asWKT "MULTIPOLYGON (((149.06016596 -35.23610602, 149.060620714 -35.236043434, ... , 149.06016596 -35.23610602)))"^^geo:WktLiteral ;
    ] ;
.
```

Here a `Feature` is declared, given a preferred label and a geometry for that `Feature` is indicated with the use of `geo:hasGeometry`. The `Geometry` indicated is described using a _Well-Known Text_ literal value, indicated by the property `geo:asWKT` and the literal type `geo:WktLiteral`.

===== B 1.1.2.3 `Feature` with both `Geometry` and `SpatialMeasure` instances indicated

```turtle
@prefix qudt: <http://qudt.org/schema/qudt/> .

eg:x a geo:Feature ;
    skos:prefLabel "Feature X";
        geo:hasGeometry [
            geo:asWKT "MULTIPOLYGON (((149.06016596 -35.23610602, 149.060620714 -35.236043434, ... , 149.06016596 -35.23610602)))"^^geo:WktLiteral ;
    ] ;
    geo:hasArea [
        a geo:SpatialMeasure ;
        qudt:numericValue 8.7 ;
        qudt:unit <http://qudt.org/vocab/unit/HA> ;  # hectare
    ] ;
.
```

Here a `Feature` and a `Geometry` are described as per the previous example but an additional `SpatialMeasure` for the `Feature` is indicated with the use of the property `geo:hasArea`. This property indicates a `SpatialMeasure` instance which conveys its value using the _Quantities, Units, Dimensions and Types (QUDT)_ ontologyfootnote:[http://www.qudt.org]

Note that in this example, the use of QUDT and its `qudt:numericValue` & `qudt:unit` is just one of many possible ways to convey a `SpatialMeasure` instance's value.

===== B 1.1.2.4 `Feature` with two different `Geometry` instances indicated

```turtle
@prefix qudt: <http://qudt.org/schema/qudt/> .

eg:x a geo:Feature ;
    skos:prefLabel "Feature X";
    geo:hasGeometry [
        rdfs:label "Official boundary" ;
        rdfs:comment "Official boundary from the Department of Xxx" ;
        geo:asWKT "MULTIPOLYGON (((149.06016596 -35.23610602, 149.060620714 -35.236043434, ... , 149.06016596 -35.23610602)))"^^geo:WktLiteral ;
    ] ,
    [
        rdfs:label "Unofficial boundary" ;
        rdfs:comment "Unofficial boundary as actually used by everyone" ;
        geo:asWKT "MULTIPOLYGON (((149.06016597 -35.23610603, 149.060620715 -35.236043435, ... , 149.06016597 -35.23610603)))"^^geo:WktLiteral ;
    ] ;
.
```

In this example, `Feature X` has two differnt `Geometry` instances indicated with their different explained in annotation properties. No ontology properties are used to indicate a difference in these `Geometry` thus machine use of this `Feature` woud not be easily able to differentiate them.

===== B 1.1.2.5 `Feature` with two different `Geometry` instances with different property values

```turtle
@prefix qudt: <http://qudt.org/schema/qudt/> .

eg:x a geo:Feature ;
    skos:prefLabel "Feature X";
    geo:hasGeometry [
        geo:hasSpatialResolution [
            qudt:numericValue 100 ;
            qudt:unit <http://qudt.org/vocab/unit/M> ;  # metre
        ] ;
        geo:asWKT "MULTIPOLYGON (((149.06016 -35.23610, 149.060620 -35.236043, ... , 149.06016 -35.23610)))"^^geo:WktLiteral ;
    ] ,
    [
        geo:hasSpatialResolution [
            qudt:numericValue 5 ;
            qudt:unit <http://qudt.org/vocab/unit/M> ;  # metre
        ] ;
        geo:asWKT "MULTIPOLYGON (((149.06016597 -35.23610603, 149.060620715 -35.236043435, ... , 149.06016597 -35.23610603)))"^^geo:WktLiteral ;
    ] ;
.
```

In this example, `Feature X` has two different `Geometry` instances indicated with different spatial resolutions. This use of the `geo:hasSpatialResolution` property follows Example <<B 1.1.2.3 `Feature` with both `Geometry` and `SpatialMeasure` instances indicated>> with its use of QUDT for unit & value. 

Machine use of this `Feature` would be able to differentiate the two `Geometry` instnaces based on this use of `geo:hasSpatialResolution`.

===== B 1.1.2.6 `Feature` with two different types of `Geometry` instances

```turtle
eg:x a geo:Feature ;
    skos:prefLabel "Feature X";
    geo:hasGeometry [
        geo:asWKT "POLYGON ((149.06016 -35.23610, 149.060620 -35.236043, ... , 149.06016 -35.23610))"^^geo:WktLiteral ;
    ] ;
    geo:hasCentroid [
        geo:asWKT "POINT (149.06017784 -35.23612321)"^^geo:WktLiteral ;
    ] ;
.
```

Here a `Feature` instance has two geometries, one indicated with the general property `hasGeometry` and a second indicated with the specialised property `hasCentroid` which suggests the role that the indicated geometry plays. Note that while `hasGeometry` may indicate any type of `Geometry`, `hasCentroid` should only be used to indicate a point geoemtry. It may be informally inferred that the polygonal geometry is the `Feature` instance's boundary.

==== B.1.1.3 `Geometry`
The `Geometry` class is defined in <<Class: geo:Geometry>>.

===== B1.1.3.1 Basic Use

```turtle
eg:y a geo:Geometry ;
    skos:prefLabel "Geometry Y";
.
```

Here a `Geometry` is declared and given a preferred label. 

From GeoSPARQL 1.0 use, the most commonly observed use of a `Geometry` is in relation to a `Feature` as per the example in <<B 1.1.2.2 A `Feature` related to a `Geometry`>> and often the `Geometry` is indirectly declared by the use of `hasGeometry` on the `Feature` instance indicating a Blank Node, however it is entirely possible to declare `Geometry` instances without any `Feature` instances. The next basic example declares a `Geometry` instance with an demonstration absolute URI and data.

```turtle
<https://example.com/geometry/y> 
    a geo:Geometry ;
    skos:prefLabel "Geometry Y";
    geo:asWKT "MULTIPOLYGON (((149.06016 -35.23610, 149.060620 -35.236043, ... , 149.06016 -35.23610)))"^^geo:WktLiteral ;
    geo:inSRS <http://www.opengis.net/def/crs/EPSG/0/4326> ;
.
```

Here the `Geometry` instance has data in WKT form and declares an SRS, WGS84: using the EPSG identifier.

===== B1.1.3.2 A `Geometry` with multiple serializations

```turtle
eg:x
    a geo:Feature ;
    skos:prefLabel "Feature X";
    geo:hasGeometry [
        geo:asWKT "<http://www.opengis.net/def/crs/EPSG/0/4326> MULTIPOLYGON (((149.06016 -35.23610, 149.060620 -35.236043, ... , 149.06016 -35.23610)))"^^geo:WktLiteral ;
        geo:asDGGS "<https://w3id.org/dggs/aspix> CELLLIST ((R1234 R1235 R1236 ... R1256))"^^geo:dggsLiteral ;
    ] ;
.
```

Here a single `Geometry`, linked to a `Feature` instance is expressed using two different serializations: Well-know Text and the AusPIX DGGS. Note that `inSRS` is not used for the `Geometry` instance as this would conflict with the DGGS serialization so, as per GeoSPARQL 1.0, the SRS used for the WKT serialization is nclded driectly in the WKT literal value.

==== B 1.1.4 `SpatialMeasure`
The `SpatialMeasure` class is defined in <<Class: geo:SpatialMeasure>>.

===== B1.1.4.1 Basic Use

```turtle
@prefix qudt: <http://qudt.org/schema/qudt/> .

eg:z
    a geo:SpatialMeasure ;
    skos:prefLabel "Area Z" ;
    qudt:numericValue 8.7 ;
    qudt:unit <http://qudt.org/vocab/unit/HA> ;  # hectare
```

This example defines an instance of `SpatialMeasure` and supplies it with a prefedder label, a numeric value and a unit of measure. 

`SpatialMeasure` instances may be declared in isolation like this - without reference to a `Feature` instance, just as Geometry instances may be - and future use of GeoSPARQL may see such declarations used widely however, at the time of writing GeoSPARQL 1.1, anticipated use of `SpatialMeasure` is with reference to a `Feature` instance: the _thing_ for which the spatial measure is defined. The next example give use in relation to a `Feature` instance.

```turtle
@prefix qudt: <http://qudt.org/schema/qudt/> .

eg:x
    a geo:Feature ;
    skos:prefLabel "Feature X" ;
    geo:hasArea [
        a geo:SpatialMeasure ;
        qudt:numericValue 8.7 ;
        qudt:unit <http://qudt.org/vocab/unit/HA> ;  # hectare
    ] ;
```

In this example, the `SpatialMeasure` instance has no label - only a numeric value and a unit of measure - but it is declared to be the area for "Feature X".

===== B1.1.4.1 Multiple measures

```turtle
@prefix qudt: <http://qudt.org/schema/qudt/> .

eg:x
    a geo:Feature ;
    skos:prefLabel "Lake X" ;
    eg:hasFeatureCategory <http://example.com/cat/lake> ;
    geo:hasArea [
        a geo:SpatialMeasure ;
        qudt:numericValue 8.7 ;
        qudt:unit <http://qudt.org/vocab/unit/HA> ;  # hectare
    ] ;
    geo:hasVolume [
        a geo:SpatialMeasure ;
        qudt:numericValue 624432 ;
        qudt:unit <http://qudt.org/vocab/unit/M3> ;  # cubic metre
    ]
```

This example shows a `Feature` instance with area and volume declared. A categorization of the feature is given through the use of the `eg:hasFeatureCategory` dummy property which, along with the feature's preferred label, indicate that this feature is a lake. Having both an area and a volume makes sense for a lake.

=== B.1.2 Properties

_New Features checklist - to be removed when all examples are complete:_

|===
|New element | Section

2+|_Feature Properties_
|hasBoundingBox | <<Property: geo:hasBoundingBox>>
|hasCentroid | <<Property: geo:hasCentroid>>
|hasLength | <<Property: geo:hasLength>>
|hasArea | <<Property: geo:hasArea>>
|hasVolume | <<Property: geo:hasVolume>>
2+|_Geometry Properties_
|inSRS | <<Property: geo:inSRS>>
2+|_Geometry Serializations_
|geoJSONLiteral | <<RDFS Datatype: geo:geoJSONLiteral>>
|asGeoJSON | <<Property: geo:asGeoJSON>>
|kmlLiteral | <<RDFS Datatype: geo:kmlLiteral>>
|asKML | <<Property: geo:asKML>>
|dggsWKTLiteral | <<RDFS Datatype: geo:dggsWKTLiteral>>
|asDGGS | <<Property: geo:asDGGS>>
|===

==== B.1.2.1 Feature Properties

This example shows a `Feature` instance with each of the properties defined in <<8.3. Standard Properties for geo:Feature>> used.

```turtle
eg:x
    a geo:Feature ;
    skos:preferredLabel "Feature X" ;
    geo:hasGeometry [
        geo:asWKT "<http://www.opengis.net/def/crs/EPSG/0/4326> POLYGON ((149.06016 -35.23610, ... , 149.06016 -35.23610)))"^^geo:WktLiteral ;
    ] ;
    geo:hasDefaultGeometry [
        geo:asWKT "<http://www.opengis.net/def/crs/EPSG/0/4326> POLYGON ((149.0601 -35.2361, ... , 149.0601 -35.2361)))"^^geo:WktLiteral ;
    ] ;
    geo:hasLength [
        a geo:SpatialMeasure ;
        qudt:numericValue 355 ;
        qudt:unit <http://qudt.org/vocab/unit/M> ;  # metre   
    ] ;
    geo:hasArea [
        a geo:SpatialMeasure ;
        qudt:numericValue 8.7 ;
        qudt:unit <http://qudt.org/vocab/unit/HA> ;  # hectare
    ] ;
    geo:hasVolume [
        a geo:SpatialMeasure ;
        qudt:numericValue 624432 ;
        qudt:unit <http://qudt.org/vocab/unit/M3> ;  # cubic metre        
    ]
    geo:hasCentroid [
        geo:asWKT "POINT (149.06017784 -35.23612321)"^^geo:WktLiteral ;
    ] ;
    geo:hasBoundingBox [
        geo:asWKT "<http://www.opengis.net/def/crs/EPSG/0/4326> POLYGON ((149.060 -35.236, ... , 149.060 -35.236)))"^^geo:WktLiteral ;
    ] ;
    geo:hasSpatialResolution [
        qudt:numericValue 5 ;
        qudt:unit <http://qudt.org/vocab/unit/M> ;  # metre
    ] ;
.
```

The properties defined for this example's `Feature` instance are vaguely aligned in that the values are not real but are not unrealistic either. It is outside the scope of GeoSPARQL to validate `Feature` instances' property values.

==== B.1.2.2 Geometry Properties

This example shows a `Geometry` instance declaread in relation to a `Feature` instance with each of the properties defined in <<8.4. Standard Properties for geo:Geometry>> used.

```turtle
eg:x
    a geo:Feature ;
    geo:hasGeometry [
        skos:prefLabel "Geometry Y" ;
        geo:dimension 2 ;
        geo:coordinateDimension 2 ;
        geo:spatialDimension 2 ;
        geo:isEmpty false ;
        geo:isSimple true ;
        geo:hasSerialization "<http://www.opengis.net/def/crs/EPSG/0/4326> POLYGON ((149.060 -35.236, ... , 149.060 -35.236)))"^^geo:WktLiteral ;
        geo:inSRS <http://www.opengis.net/def/crs/EPSG/0/4326> ;
    ] ;
. 
```

In this example, each of the standards properties defined for a `Geometry` instance has realistic values, for example, the `geo:isEmpty` is set to `false` since the geometry contains information. Note that the SRS of the given serialzation is given within the geoemtry literal (a WKT value) as well as by the `geo:inSRS` property.

==== B.1.2.3 Geometry Serializations

This section shows a `Geometry` instance for a `Feature` instance which is represented in all supported GeoSPARQL serlializations. The geometry values given are real geometry values and approximate link:https://en.wikipedia.org/wiki/Moreton_Island[Moreton Island] in Queensland, Australia.

```turtle
eg:x
    a geo:Feature ;
    geo:hasGeometry [
        geo:asWKT """<http://www.opengis.net/def/crs/EPSG/0/4326>
                    POLYGON ((
                        153.4688146 -27.0291517,
                        153.4557683 -27.0242584,
                        153.4337956 -27.0346564,
                        153.4090764 -27.0346564,
                        153.3781774 -27.046888,
                        153.3610112 -27.0621757,
                        153.3685643 -27.0792955,
                        153.3713109 -27.1019141,
                        153.3630712 -27.1367499,
                        153.3733708 -27.1764617,
                        153.3658177 -27.1990606,
                        153.3754308 -27.2198231,
                        153.3774907 -27.2350872,
                        153.4042699 -27.2906308,
                        153.4056432 -27.2979531,
                        153.4207494 -27.3284578,
                        153.421436 -27.3406573,
                        153.4180028 -27.354685,
                        153.4269292 -27.3607835,
                        153.4434087 -27.3315078,
                        153.4296758 -27.3174771,
                        153.4166295 -27.2613365,
                        153.4180028 -27.2106637,
                        153.4310491 -27.1373609,
                        153.4688146 -27.0291517
                    ))"""^^geo:wktLiteral ;

        geo:asGML """<?xml version="1.0" encoding="utf-8" ?>
<ogr:FeatureCollection
     xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
     xsi:schemaLocation="http://ogr.maptools.org/ moreton-island.xsd"
     xmlns:ogr="http://ogr.maptools.org/"
     xmlns:gml="http://www.opengis.net/gml">
  <ogr:featureMember>
    <ogr:moreton_island gml:id="moreton_island.0">
      <ogr:geometryProperty>
        <gml:Polygon srsName="http://www.opengis.net/def/crs/EPSG/0/4326">
          <gml:exterior>
            <gml:LinearRing>
              <gml:posList>
                -27.0291517 153.4688146 
                -27.0242584 153.4557683 
                -27.0346564 153.4337956 
                -27.0346564 153.4090764 
                -27.046888 153.3781774 
                -27.0621757 153.3610112 
                -27.0792955 153.3685643 
                -27.1019141 153.3713109 
                -27.1367499 153.3630712 
                -27.1764617 153.3733708 
                -27.1990606 153.3658177 
                -27.2198231 153.3754308 
                -27.2350872 153.3774907 
                -27.2906308 153.4042699 
                -27.2979531 153.4056432 
                -27.3284578 153.4207494 
                -27.3406573 153.421436 
                -27.354685 153.4180028 
                -27.3607835 153.4269292 
                -27.3315078 153.4434087 
                -27.3174771 153.4296758 
                -27.2613365 153.4166295 
                -27.2106637 153.4180028 
                -27.1373609 153.4310491 
                -27.0291517 153.4688146
              </gml:posList>
            </gml:LinearRing>
          </gml:exterior>
        </gml:Polygon>
      </ogr:geometryProperty>
      <ogr:Name>Moreton Island</ogr:Name>
    </ogr:moreton_island>
  </ogr:featureMember>
</ogr:FeatureCollection>"""^^go:gmlLiteral ;

        geo:asKML """<?xml version="1.0" encoding="UTF-8"?>
<kml xmlns="http://www.opengis.net/kml/2.2">
  <Document>
    <Placemark>
      <name>Moreton Island</name>
      <Polygon>
        <outerBoundaryIs>
          <LinearRing>
            <tessellate>1</tessellate>
            <coordinates>
              153.4688146,-27.0291517,0
              153.4557683,-27.0242584,0
              153.4337956,-27.0346564,0
              153.4090764,-27.0346564,0
              153.3781774,-27.046888,0
              153.3610112,-27.0621757,0
              153.3685643,-27.0792955,0
              153.3713109,-27.1019141,0
              153.3630712,-27.1367499,0
              153.3733708,-27.1764617,0
              153.3658177,-27.1990606,0
              153.3754308,-27.2198231,0
              153.3774907,-27.2350872,0
              153.4042699,-27.2906308,0
              153.4056432,-27.2979531,0
              153.4207494,-27.3284578,0
              153.421436,-27.3406573,0
              153.4180028,-27.354685,0
              153.4269292,-27.3607835,0
              153.4434087,-27.3315078,0
              153.4296758,-27.3174771,0
              153.4166295,-27.2613365,0
              153.4180028,-27.2106637,0
              153.4310491,-27.1373609,0
              153.4688146,-27.0291517,0
            </coordinates>
          </LinearRing>
        </outerBoundaryIs>
      </Polygon>
    </Placemark>
  </Document>
</kml>"""^^go:kmlLiteral ;

        geo:asGeoJSON """{
	"type": "FeatureCollection",
	"name": "moreton-island",
	"crs": {
		"type": "name",
		"properties": {
			"name": "urn:ogc:def:crs:OGC:1.3:CRS84"
		}
	},
	"features": [{
		"type": "Feature",
		"properties": {
			"Name": "Moreton Island"
		},
		"geometry": {
			"type": "Polygon",
			"coordinates": [
				[
					[153.4688146, -27.0291517],
					[153.455768299999988, -27.0242584],
					[153.4337956, -27.0346564],
					[153.4090764, -27.0346564],
					[153.3781774, -27.046888],
					[153.3610112, -27.0621757],
					[153.3685643, -27.0792955],
					[153.3713109, -27.1019141],
					[153.3630712, -27.1367499],
					[153.3733708, -27.1764617],
					[153.3658177, -27.1990606],
					[153.3754308, -27.2198231],
					[153.37749070000001, -27.2350872],
					[153.4042699, -27.2906308],
					[153.405643199999986, -27.2979531],
					[153.4207494, -27.3284578],
					[153.421436, -27.3406573],
					[153.418002800000011, -27.354685],
					[153.426929199999989, -27.3607835],
					[153.4434087, -27.3315078],
					[153.429675800000012, -27.3174771],
					[153.4166295, -27.2613365],
					[153.418002800000011, -27.2106637],
					[153.4310491, -27.1373609],
					[153.4688146, -27.0291517]
				]
			]
		}
	}]
}"""^^geo:geoJSONLiteral ;

        geo:asDGGS """<https://w3id.org/dggs/auspix> CELLLIST ((
R8346031 R8346034 R8346037 R83460058 R83460071 R83460072 R83460073 R83460074 
R83460075 R83460076 R83460077 R83460078 R83460080 R83460081 R83460082 R83460083 
R83460084 R83460086 R83460087 R83460320 R83460321 R83460323 R83460326 R83460350 
R83460610 R83460611 R83460612 R83460614 R83460615 R83460617 R83460618 R83460641 
R83460642 R83460645 R83460648 R834600476 R834600477 R834600478 R834600483 R834600484 
R834600485 R834600486 R834600487 R834600488 R834600556 R834600557 R834600558 R834600563 
R834600564 R834600565 R834600566 R834600567 R834600568 R834600571 R834600572 R834600573
R834600574 R834600575 R834600576 R834600577 R834600578 R834600628 R834600651 R834600652 
R834600654 R834600655 R834600657 R834600658 R834600681 R834600682 R834600685 R834600688 
R834600701 R834600702 R834600703 R834600704 R834600705 R834600706 R834600707 R834600708 
R834600850 R834600851 R834600852 R834600853 R834600854 R834600855 R834600856 R834600857 
R834600880 R834600881 R834600883 R834600884 R834600886 R834601336 R834601337 R834601360 
R834601361 R834601363 R834601364 R834601366 R834601600 R834601603 R834603022 R834603025 
R834603028 R834603052 R834603055 R834603058 R834603082 R834603085 R834603087 R834603088 
R834603220 R834603223 R834603240 R834603241 R834603242 R834603243 R834603244 R834603245 
R834603246 R834603247 R834603270 R834603271 R834603273 R834603274 R834603276 R834603321 
R834603322 R834603324 R834603325 R834603327 R834603328 R834603351 R834603352 R834603354 
R834603355 R834603357 R834603358 R834603382 R834603385 R834603388 R834603510 R834603513 
R834603530 R834603531 R834603532 R834603533 R834603534 R834603535 R834603536 R834603537 
R834603538 R834603560 R834603561 R834603562 R834603563 R834603564 R834603566 R834603567 
R834603622 R834603655 R834603658 R834603682 R834603685 R834603687 R834603688 R834603800 
R834603801 R834603803 R834603804 R834603806 R834603807 R834603830 R834603831 R834603833 
R834603836 R834603860 R834603863 R834603866 R834606022 R834606025 R834606130 R834606131 
R834606132 R834606133 R834606134 R834606135 R834606137 R834606138 R834606161 R834606162 
R834606164 R834606165 R834606167 R834606168 R834606200 R834606402 R834606405 R834606440 
R834606441 R834606442 R834606444 R834606445 R834606447 R834606448 R834606472 R834606475 
R834606563 R834606566 R834606720 R834606721 R834606722 R834606723 R834606724 R834606725 
R834606727 R834606728 R834606751 R834606752 R834606754 R834606755 R834606758 R834606782 
R834606800 R834606803 R834606806 R834606807 R834606830 R834606831 R834606833 R834606834 
R834606836 R834606837 R834606860 R834606861 R834606863 R834606864 R834606865 R834606866 
R834606867 R834606868 R834630201 R834630202 R834630204 R834630205 R834630207 R834630208 
R834630210 R834630213 R834630214 R834630216 R834630217 R834630218 R834630231 R834630232 
R834630234 R834630235 R834630237 R834630238 R834630240 R834630241 R834630243 R834630244 
R834630246 R834630261 R834630262 R834630264 R834630265 R834630268 R834630270 R8346004677 
R8346004678 R8346004684 R8346004685 R8346004686 R8346004687 R8346004688 R8346004738 R8346004745 
R8346004746 R8346004747 R8346004748 R8346004751 R8346004752 R8346004753 R8346004754 R8346004755 
R8346004756 R8346004757 R8346004758 R8346004807 R8346004808 R8346004813 R8346004814 R8346004815 
R8346004816 R8346004817 R8346004818 R8346004823 R8346004824 R8346004825 R8346004826 R8346004827 
R8346004828 R8346005478 R8346005484 R8346005485 R8346005486 R8346005487 R8346005488 R8346005538 
R8346005544 R8346005545 R8346005546 R8346005547 R8346005548 R8346005551 R8346005552 R8346005553 
R8346005554 R8346005555 R8346005556 R8346005557 R8346005558 R8346005603 R8346005604 R8346005605 
R8346005606 R8346005607 R8346005608 R8346005613 R8346005614 R8346005615 R8346005616 R8346005617 
R8346005618 R8346005623 R8346005624 R8346005625 R8346005626 R8346005627 R8346005628 R8346005703 
R8346005704 R8346005705 R8346005706 R8346005707 R8346005708 R8346006248 R8346006252 R8346006254 
R8346006255 R8346006256 R8346006257 R8346006258 R8346006268 R8346006271 R8346006272 R8346006273 
R8346006274 R8346006275 R8346006276 R8346006277 R8346006278 R8346006501 R8346006502 R8346006503 
R8346006504 R8346006505 R8346006506 R8346006507 R8346006508 R8346006530 R8346006531 R8346006532 
R8346006533 R8346006534 R8346006535 R8346006537 R8346006538 R8346006561 R8346006562 R8346006565 
R8346006568 R8346006802 R8346006841 R8346006842 R8346006844 R8346006845 R8346006848 R8346006872 
R8346006875 R8346006878 R8346007002 R8346007004 R8346007005 R8346007006 R8346007007 R8346007008 
R8346008580 R8346008581 R8346008582 R8346008583 R8346008584 R8346008586 R8346008587 R8346008820 
R8346008821 R8346008823 R8346008826 R8346008850 R8346008870 R8346008871 R8346008872 R8346008873 
R8346008874 R8346008876 R8346008877 R8346013330 R8346013333 R8346013334 R8346013335 R8346013336 
R8346013337 R8346013338 R8346013343 R8346013346 R8346013347 R8346013348 R8346013356 R8346013380 
R8346013381 R8346013383 R8346013384 R8346013386 R8346013387 R8346013620 R8346013621 R8346013623 
R8346013626 R8346013650 R8346013670 R8346013671 R8346013672 R8346013673 R8346013674 R8346013676 
R8346013677 R8346016010 R8346016011 R8346016013 R8346016016 R8346016040 R8346016060 R8346016061 
R8346016062 R8346016063 R8346016064 R8346016066 R8346016067 R8346016300 R8346016301 R8346016303 
R8346016306 R8346016330 R8346030212 R8346030215 R8346030218 R8346030242 R8346030572 R8346030575 
R8346030578 R8346030812 R8346030815 R8346030817 R8346030818 R8346030841 R8346030842 R8346030844 
R8346030845 R8346030847 R8346030848 R8346032210 R8346032211 R8346032213 R8346032216 R8346032240 
R8346032260 R8346032261 R8346032262 R8346032263 R8346032264 R8346032266 R8346032267 R8346032480 
R8346032481 R8346032482 R8346032483 R8346032484 R8346032486 R8346032487 R8346032500 R8346032501 
R8346032503 R8346032506 R8346032530 R8346032720 R8346032721 R8346032723 R8346032726 R8346032750 
R8346032770 R8346032771 R8346032772 R8346032773 R8346032774 R8346032776 R8346032777 R8346033208 
R8346033232 R8346033235 R8346033238 R8346033261 R8346033262 R8346033264 R8346033265 R8346033267 
R8346033268 R8346033501 R8346033502 R8346033504 R8346033505 R8346033508 R8346033532 R8346033535 
R8346033538 R8346033810 R8346033811 R8346033812 R8346033814 R8346033815 R8346033817 R8346033818 
R8346033841 R8346033842 R8346033844 R8346033845 R8346033848 R8346033872 R8346033875 R8346033878 
R8346035110 R8346035111 R8346035113 R8346035116 R8346035140 R8346035160 R8346035161 R8346035162 
R8346035163 R8346035164 R8346035166 R8346035167 R8346035400 R8346035401 R8346035403 R8346035406 
R8346035430 R8346035433 R8346035436 R8346035460 R8346035650 R8346035651 R8346035652 R8346035653 
R8346035654 R8346035656 R8346035657 R8346035680 R8346035681 R8346035683 R8346035684 R8346035686 
R8346035687 R8346036250 R8346036251 R8346036252 R8346036254 R8346036255 R8346036257 R8346036258 
R8346036281 R8346036282 R8346036284 R8346036285 R8346036288 R8346036521 R8346036522 R8346036524 
R8346036525 R8346036527 R8346036528 R8346036575 R8346036578 R8346036812 R8346036814 R8346036815 
R8346036817 R8346036818 R8346036841 R8346036842 R8346036843 R8346036844 R8346036845 R8346036846 
R8346036847 R8346036848 R8346038020 R8346038021 R8346038023 R8346038026 R8346038050 R8346038053 
R8346038056 R8346038080 R8346038340 R8346038341 R8346038342 R8346038343 R8346038344 R8346038346 
R8346038347 R8346038370 R8346038371 R8346038373 R8346038374 R8346038376 R8346038377 R8346038610 
R8346038611 R8346038613 R8346038616 R8346038640 R8346038643 R8346038646 R8346060211 R8346060212 
R8346060214 R8346060215 R8346060218 R8346060242 R8346060281 R8346060282 R8346060284 R8346060285 
R8346060287 R8346060288 R8346060522 R8346060525 R8346061361 R8346061362 R8346061364 R8346061365 
R8346061367 R8346061368 R8346061601 R8346061602 R8346061604 R8346061605 R8346061607 R8346061608 
R8346061631 R8346061632 R8346061634 R8346061635 R8346061638 R8346061662 R8346062030 R8346062031 
R8346062033 R8346062034 R8346062036 R8346062037 R8346062060 R8346062061 R8346062063 R8346062064 
R8346062066 R8346062067 R8346062300 R8346062301 R8346062303 R8346062304 R8346062306 R8346062307 
R8346062330 R8346062331 R8346062333 R8346062334 R8346062336 R8346062337 R8346062360 R8346062361 
R8346062363 R8346062364 R8346062366 R8346062367 R8346062600 R8346062601 R8346062603 R8346062604 
R8346062606 R8346062607 R8346062630 R8346062631 R8346062633 R8346062634 R8346062636 R8346062637 
R8346062660 R8346062661 R8346062663 R8346062664 R8346062666 R8346062667 R8346064011 R8346064012 
R8346064014 R8346064015 R8346064018 R8346064042 R8346064080 R8346064081 R8346064082 R8346064084 
R8346064085 R8346064087 R8346064088 R8346064322 R8346064325 R8346064430 R8346064431 R8346064432 
R8346064434 R8346064435 R8346064437 R8346064438 R8346064462 R8346064465 R8346064468 R8346064710 
R8346064711 R8346064712 R8346064713 R8346064714 R8346064715 R8346064717 R8346064718 R8346064741 
R8346064742 R8346064745 R8346064748 R8346064780 R8346064781 R8346064782 R8346064783 R8346064784 
R8346064785 R8346064787 R8346064788 R8346065000 R8346065003 R8346065006 R8346065030 R8346065033 
R8346065036 R8346065060 R8346065063 R8346065066 R8346065300 R8346065303 R8346065306 R8346065330 
R8346065333 R8346065336 R8346065337 R8346065360 R8346065361 R8346065363 R8346065364 R8346065366 
R8346065367 R8346065600 R8346065601 R8346065603 R8346065604 R8346065605 R8346065606 R8346065607 
R8346065608 R8346065646 R8346065670 R8346065673 R8346065676 R8346067121 R8346067122 R8346067125 
R8346067128 R8346067152 R8346067261 R8346067262 R8346067264 R8346067265 R8346067267 R8346067268 
R8346067502 R8346067505 R8346067508 R8346067532 R8346067571 R8346067572 R8346067574 R8346067575 
R8346067578 R8346067812 R8346067850 R8346067851 R8346067852 R8346067854 R8346067855 R8346067857 
R8346067858 R8346067882 R8346067885 R8346068010 R8346068013 R8346068014 R8346068016 R8346068017 
R8346068040 R8346068041 R8346068043 R8346068044 R8346068046 R8346068047 R8346068048 R8346068323 
R8346068326 R8346068350 R8346068353 R8346068356 R8346068357 R8346068380 R8346068381 R8346068383 
R8346068384 R8346068386 R8346068387 R8346068620 R8346068621 R8346068623 R8346068624 R8346068625 
R8346068626 R8346068627 R8346068628 R8346068736 R8346068760 R8346068763 R8346068764 R8346068766 
R8346068767 R8346068768 R8346302000 R8346302001 R8346302002 R8346302004 R8346302005 R8346302007 
R8346302008 R8346302032 R8346302035 R8346302110 R8346302113 R8346302114 R8346302116 R8346302117 
R8346302118 R8346302150 R8346302153 R8346302156 R8346302157 R8346302263 R8346302368 R8346302420 
R8346302421 R8346302422 R8346302423 R8346302424 R8346302426 R8346302427 R8346302450 R8346302453 
R8346302470 R8346302471 R8346302472 R8346302473 R8346302474 R8346302476 R8346302477 R8346302602 
R8346302605 R8346302608 R8346302631 R8346302632 R8346302634 R8346302635 R8346302637 R8346302638 
R8346302662 R8346302670 R8346302671 R8346302672 R8346302673 R8346302674 R8346302675 R8346302678 
R8346302710 R8346302730 R8346302731 R8346302733 R8346302734 R8346302736 R8346302760 R8346305020 
R8346305021))"""^^geo:dggsLiteral ;
    ] ;
.

```

== B.2 Example SPARQL Queries & Rules 

_New Features checklist - to be removed when all examples are complete:_

|===
|New element | Section

2+|_Non-topological Query Functions_
|maxX | <<Function: geof:maxX>>
|maxY | <<Function: geof:maxY>>
|maxZ | <<Function: geof:maxZ>>
|minX | <<Function: geof:minX>>
|minY | <<Function: geof:minY>>
|minZ | <<Function: geof:minZ>>
2+|_Spatial Aggregate Functions_
|BBOX | <<Function: geosaf:BBOX>>
|BoundingCircle | <<Function: geoaf:BoundingCircle>>
|Centroid | <<Function: geoaf:Centroid>>
|ConcatLines | <<Function: geoaf:ConcatLines>>
|ConcaveHull | <<Function: geoaf:ConcaveHull>>
|ConvexHull | <<Function: geoaf:ConvexHull>>
|Union | <<Function: geoaf:Union>>
|===


This Section provides example data and then illustrates the use of GeoSPARQL functions and the application of rules with that data.

=== B.2.1 Example Data

The following RDF data (Turtle format) encodes application-specific spatial data. The resulting spatial data is illustrated in Figure 3. The RDF statements define the feature class `my:PlaceOfInterest`, and two properties are created for associating geometries with features: `my:hasExactGeometry` and `my:hasPointGeometry`. `my:hasExactGeometry` is designated as the default geometry for the `my:PlaceOfInterest` feature class.

All the following examples use the parameter values relation_family = Simple Features, serialization = WKT, and version = 1.0.

[#img-illustration]
.Illustration of spatial data
image::img/03.png[RDF Triple,300,200]

```turtle
@prefix geo: <http://www.opengis.net/ont/geosparql#> .
@prefix my: <http://example.org/ApplicationSchema#> .
@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .
@prefix sf: <http://www.opengis.net/ont/sf#> .

my:PlaceOfInterest a rdfs:Class ;
    rdfs:subClassOf geo:Feature .

my:A a my:PlaceOfInterest ;
    my:hasExactGeometry my:AExactGeom ;
    my:hasPointGeometry my:APointGeom .

my:B a my:PlaceOfInterest ;
    my:hasExactGeometry my:BExactGeom ;
    my:hasPointGeometry my:BPointGeom .

my:C a my:PlaceOfInterest ;
    my:hasExactGeometry my:CExactGeom ;
    my:hasPointGeometry my:CPointGeom .

my:D a my:PlaceOfInterest ;
    my:hasExactGeometry my:DExactGeom ;
    my:hasPointGeometry my:DPointGeom .

my:E a my:PlaceOfInterest ;
    my:hasExactGeometry my:EExactGeom .

my:F a my:PlaceOfInterest ;
    my:hasExactGeometry my:FExactGeom .

my:hasExactGeometry a rdf:Property ;
    rdfs:subPropertyOf geo:hasDefaultGeometry,
        geo:hasGeometry .

my:hasPointGeometry a rdf:Property ;
    rdfs:subPropertyOf geo:hasGeometry .

my:AExactGeom a sf:Polygon ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84> 
                 Polygon((-83.6 34.1, -83.2 34.1, -83.2 34.5,
                 -83.6 34.5, -83.6 34.1))"""^^geo:wktLiteral.

my:APointGeom a sf:Point ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84> 
                 Point(-83.4 34.3)"""^^geo:wktLiteral.

my:BExactGeom a sf:Polygon ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84>
                 Polygon((-83.6 34.1, -83.4 34.1, -83.4 34.3,
                 -83.6 34.3, -83.6 34.1))"""^^geo:wktLiteral.

my:BPointGeom a sf:Point ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84>
                 Point(-83.5 34.2)"""^^geo:wktLiteral.

my:CExactGeom a sf:Polygon ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84>
                 Polygon((-83.2 34.3, -83.0 34.3, -83.0 34.5,
                 -83.2 34.5, -83.2 34.3))"""^^geo:wktLiteral.

my:CPointGeom a sf:Point ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84>
                 Point(-83.1 34.4)"""^^geo:wktLiteral.

my:DExactGeom a sf:Polygon ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84> 
                 Polygon((-83.3 34.0, -83.1 34.0, -83.1 34.2,
                 -83.3 34.2, -83.3 34.0))"""^^geo:wktLiteral.

my:DPointGeom a sf:Point ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84>
                 Point(-83.2 34.1)"""^^geo:wktLiteral.

my:EExactGeom a sf:LineString ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84>
                 LineString((-83.4 34.0, -83.3 34.3))"""^^geo:wktLiteral.

my:FExactGeom a sf:Point ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84>
                 Point(-83.4 34.4)"""^^geo:wktLiteral.
```

=== B.2.2 Example Queries

This Section illustrates the use of GeoSPARQL functions through a series of example queries.

==== Example Query 1
_Find all features that feature `my:A` contains, where spatial calculations are based on_ `my:hasExactGeometry`.

```sparql
PREFIX my: <http://example.org/ApplicationSchema#>
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/>

SELECT ?f
WHERE { 
    my:A my:hasExactGeometry ?aGeom .
    ?aGeom geo:asWKT ?aWKT .
    ?f my:hasExactGeometry ?fGeom .
    ?fGeom geo:asWKT ?fWKT .

    FILTER (
        geof:sfContains(?aWKT, ?fWKT) &&
            !sameTerm(?aGeom, ?fGeom)
        )
)
```

*Result*:
|===
|*?f*

|`my:B`
|`my:F`
|===

==== Example Query 2
_Find all features that are within a transient bounding box geometry, where spatial calculations are based on_ `my:hasPointGeometry`.

```sparql
PREFIX my: <http://example.org/ApplicationSchema#>
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/>

SELECT ?f
WHERE { 
    ?f my:hasPointGeometry ?fGeom .
    ?fGeom geo:asWKT ?fWKT . 
    FILTER (
        geof:sfWithin(
            ?fWKT,
            "<http://www.opengis.net/def/crs/OGC/1.3/CRS84> 
            Polygon ((-83.4 34.0, -83.1 34.0,
                        -83.1 34.2, -83.4 34.2,
                        -83.4 34.0))"^^geo:wktLiteral
        )
    )
}
```

*Result*:
|===
|*?f*

|`my:D`
|===

==== Example Query 3
_Find all features that touch the union of feature `my:A` and feature `my:D`,
where computations are based on_ `my:hasExactGeometry`.

```sparql
PREFIX my: <http://example.org/ApplicationSchema#>
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/>

SELECT ?f
WHERE { 
    ?f my:hasExactGeometry ?fGeom .
    ?fGeom geo:asWKT ?fWKT .
    my:A my:hasExactGeometry ?aGeom . 
    ?aGeom geo:asWKT ?aWKT .
    ?my:D my:hasExactGeometry ?dGeom . 
    ?dGeom geo:asWKT ?dWKT .
    FILTER (
        geof:sfTouches(
            ?fWKT,
            geof:union(?aWKT, ?dWKT)
        )
    )
}
```

*Result*:
|===
|*?f*

|`my:C`
|===

==== Example Query 4
_Find the 3 closest features to feature my:C, where computations are based on_ `my:hasExactGeometry`.

```sparql
PREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/> 
PREFIX my: <http://example.org/ApplicationSchema#>
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX geof: <http://www.opengis.net/def/geosparql/function>

SELECT ?f
WHERE { 
    my:C my:hasExactGeometry ?cGeom .
    ?cGeom geo:asWKT ?cWKT .
    ?f my:hasExactGeometry ?fGeom . ?fGeom geo:asWKT ?fWKT .
    FILTER (?fGeom != ?cGeom) 
}
ORDER BY ASC (geof:distance(?cWKT, ?fWKT, uom:metre)) 
LIMIT 3
```

*Result*:
|===
|*?f*

|`my:A`
|`my:D`
|`my:E`
|===

=== B.2.3 Example Rule Application

This section illustrates the query transformation strategy for implementing GeoSPARQL rules.

==== Example Rule 1
_Find all features or geometries that overlap feature_ `my:A`.

*Original Query*:

```sparql
PREFIX geo: <http://www.opengis.net/ont/geosparql#>

SELECT ?f
WHERE { ?f geo:sfOverlaps my:A }
```

*Transformed Query (application of transformation rule geor:sfOverlaps)*:

```sparql
PREFIX my: <http://example.org/ApplicationSchema#>
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/>

SELECT ?f
WHERE { 
    { # check for asserted statement
        ?f geo:sfOverlaps my:A } 
    UNION
    { # feature – feature
        ?f geo:hasDefaultGeometry ?fGeom . 
        ?fGeom geo:asWKT ?fSerial .
        my:A geo:hasDefaultGeometry ?aGeom .
        ?aGeom geo:asWKT ?aSerial .
        FILTER (geof:sfOverlaps(?fSerial, ?aSerial)) 
    } 
    UNION
    { # feature – geometry
        ?f geo:hasDefaultGeometry ?fGeom .
        ?fGeom geo:asWKT ?fSerial .
        my:A geo:asWKT ?aSerial .
        FILTER (geof:sfOverlaps(?fSerial, ?aSerial)) 
    }
    UNION
    { # geometry – feature
        ?f geo:asWKT ?fSerial .
        my:A geo:hasDefaultGeometry ?aGeom .
        ?aGeom geo:asWKT ?aSerial .
        FILTER (geof:sfOverlaps(?fSerial, ?aSerial)) 
    }
    UNION
    { # geometry – geometry
        ?f geo:hasDefaultGeometry ?fGeom . 
        ?fGeom geo:asWKT ?fSerial .
        my:A geo:hasDefaultGeometry ?aGeom . 
        ?aGeom geo:asWKT ?aSerial .
        FILTER (geof:sfOverlaps(?fSerial, ?aSerial)) 
    } 
}
```

*Result*:
|===
|*?f*

|`my:D`
|`my:DExactGeom`
|`my:E`
|`my:EExactGeom`
|===


=== B.2.4 Example Geometry Serialization Conversion Functions

_New Features checklist - to be removed when all examples are complete:_

|===
|New element | Section

2+|_Geometry Serializations_
|asWKT function | <<Function: geof:asWKT>>
|asGML function | <<Function: geof:asGML>>
|asGeoJSON function | <<Function: geof:asGeoJSON>>
|asKML function | <<Function: geof:asKML>>
|===

==== B.1.2.2.1 `geof:asWKT`

For the geoemtry literal values in <<B.1.2.3 Geometry Serializations>>:

Application of the function `geof:asWKT` to the GML, KML, GeoJSON and DGGS literals should return WKT literal and similarly for each of the other conversion methods, `geof:asGML`, `geof:asKML`, `geof:asGeoJSON` & `geof:asDGGS`.

Note that the application of `geof:asDGGS` requires a `dggsIri` parameter which indicates the IRI of the particular DGGS being converted to. In the case of <<B.1.2.3 Geometry Serializations>>, thsi value would be `+https://w3id.org/dggs/auspix+`, the IRI of the AusPIX DGGS.