= Annex B (informative) GeoSPARQL Examples

== B.1 Example Data

The following RDF data (Turtle format) encodes application-specific spatial data. The resulting spatial data is illustrated in Figure 3. The RDF statements define the feature class `my:PlaceOfInterest`, and two properties are created for associating geometries with features: `my:hasExactGeometry` and `my:hasPointGeometry`. `my:hasExactGeometry` is designated as the default geometry for the `my:PlaceOfInterest` feature class.

All the following examples use the parameter values relation_family = Simple Features, serialization = WKT, and version = 1.0.

[#img-illustration]
.Illustration of spatial data
image::img/03.png[RDF Triple,300,200]

```
@prefix geo: <http://www.opengis.net/ont/geosparql#> .
@prefix my: <http://example.org/ApplicationSchema#> .
@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .
@prefix sf: <http://www.opengis.net/ont/sf#> .

my:PlaceOfInterest a rdfs:Class ;
    rdfs:subClassOf geo:Feature .

my:A a my:PlaceOfInterest ;
    my:hasExactGeometry my:AExactGeom ;
    my:hasPointGeometry my:APointGeom .

my:B a my:PlaceOfInterest ;
    my:hasExactGeometry my:BExactGeom ;
    my:hasPointGeometry my:BPointGeom .

my:C a my:PlaceOfInterest ;
    my:hasExactGeometry my:CExactGeom ;
    my:hasPointGeometry my:CPointGeom .

my:D a my:PlaceOfInterest ;
    my:hasExactGeometry my:DExactGeom ;
    my:hasPointGeometry my:DPointGeom .

my:E a my:PlaceOfInterest ;
    my:hasExactGeometry my:EExactGeom .

my:F a my:PlaceOfInterest ;
    my:hasExactGeometry my:FExactGeom .

my:hasExactGeometry a rdf:Property ;
    rdfs:subPropertyOf geo:hasDefaultGeometry,
        geo:hasGeometry .

my:hasPointGeometry a rdf:Property ;
    rdfs:subPropertyOf geo:hasGeometry .

my:AExactGeom a sf:Polygon ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84> 
                 Polygon((-83.6 34.1, -83.2 34.1, -83.2 34.5,
                 -83.6 34.5, -83.6 34.1))"""^^geo:wktLiteral.

my:APointGeom a sf:Point ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84> 
                 Point(-83.4 34.3)"""^^geo:wktLiteral.

my:BExactGeom a sf:Polygon ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84>
                 Polygon((-83.6 34.1, -83.4 34.1, -83.4 34.3,
                 -83.6 34.3, -83.6 34.1))"""^^geo:wktLiteral.

my:BPointGeom a sf:Point ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84>
                 Point(-83.5 34.2)"""^^geo:wktLiteral.

my:CExactGeom a sf:Polygon ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84>
                 Polygon((-83.2 34.3, -83.0 34.3, -83.0 34.5,
                 -83.2 34.5, -83.2 34.3))"""^^geo:wktLiteral.

my:CPointGeom a sf:Point ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84>
                 Point(-83.1 34.4)"""^^geo:wktLiteral.

my:DExactGeom a sf:Polygon ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84> 
                 Polygon((-83.3 34.0, -83.1 34.0, -83.1 34.2,
                 -83.3 34.2, -83.3 34.0))"""^^geo:wktLiteral.

my:DPointGeom a sf:Point ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84>
                 Point(-83.2 34.1)"""^^geo:wktLiteral.

my:EExactGeom a sf:LineString ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84>
                 LineString((-83.4 34.0, -83.3 34.3))"""^^geo:wktLiteral.

my:FExactGeom a sf:Point ;
    geo:asWKT """<http://www.opengis.net/def/crs/OGC/1.3/CRS84>
                 Point(-83.4 34.4)"""^^geo:wktLiteral.
```

== B.2 Example Queries

This Section illustrates the use of GeoSPARQL functions through a series of example queries.

*Example 1*: _Find all features that feature `my:A` contains, where spatial calculations are based on_ `my:hasExactGeometry`.

```
PREFIX my: <http://example.org/ApplicationSchema#>
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/>

SELECT ?f
WHERE { 
    my:A my:hasExactGeometry ?aGeom .
    ?aGeom geo:asWKT ?aWKT .
    ?f my:hasExactGeometry ?fGeom .
    ?fGeom geo:asWKT ?fWKT .
    FILTER (geof:sfContains(?aWKT, ?fWKT) &&
            !sameTerm(?aGeom, ?fGeom))
)
```

*Result*:
|===
|*?f*

|`my:B`
|`my:F`
|===

*Example 2*: _Find all features that are within a transient bounding box geometry, where spatial calculations are based on_ `my:hasPointGeometry`.

```
PREFIX my: <http://example.org/ApplicationSchema#>
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/>

SELECT ?f
WHERE { ?f my:hasPointGeometry ?fGeom .
        ?fGeom geo:asWKT ?fWKT . 
        FILTER (geof:sfWithin(?fWKT,
                "<http://www.opengis.net/def/crs/OGC/1.3/CRS84> 
                Polygon ((-83.4 34.0, -83.1 34.0,
                          -83.1 34.2, -83.4 34.2,
                          -83.4 34.0))"^^geo:wktLiteral))
)
```

*Result*:
|===
|*?f*

|`my:D`
|===

*Example 3*: _Find all features that touch the union of feature `my:A` and feature `my:D`,
where computations are based on_ `my:hasExactGeometry`.

```
PREFIX my: <http://example.org/ApplicationSchema#>
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/>

SELECT ?f
WHERE { ?f my:hasExactGeometry ?fGeom .
        ?fGeom geo:asWKT ?fWKT .
        my:A my:hasExactGeometry ?aGeom . 
        ?aGeom geo:asWKT ?aWKT .
        ?my:D my:hasExactGeometry ?dGeom . 
        ?dGeom geo:asWKT ?dWKT .
        FILTER (geof:sfTouches(?fWKT,
                geof:union(?aWKT, ?dWKT)))
}
```

*Result*:
|===
|*?f*

|`my:C`
|===

*Example 4*: _Find the 3 closest features to feature my:C, where computations are based on_ `my:hasExactGeometry`.

```
PREFIX uom: <http://www.opengis.net/def/uom/OGC/1.0/> 
PREFIX my: <http://example.org/ApplicationSchema#>
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX geof: <http://www.opengis.net/def/geosparql/function>

SELECT ?f
WHERE { my:C my:hasExactGeometry ?cGeom .
        ?cGeom geo:asWKT ?cWKT .
        ?f my:hasExactGeometry ?fGeom . ?fGeom geo:asWKT ?fWKT .
        FILTER (?fGeom != ?cGeom) }
ORDER BY ASC (geof:distance(?cWKT, ?fWKT,
              uom:metre)) 
LIMIT 3
```

*Result*:
|===
|*?f*

|`my:A`
|`my:D`
|`my:E`
|===

== B.3 Example Rule Application

This section illustrates the query transformation strategy for implementing GeoSPARQL rules.

*Example 5*: _Find all features or geometries that overlap feature_ `my:A`.

*Original Query*:

```
PREFIX geo: <http://www.opengis.net/ont/geosparql#>

SELECT ?f
WHERE { ?f geo:sfOverlaps my:A }
```

*Transformed Query (application of transformation rule geor:sfOverlaps)*:

```
PREFIX my: <http://example.org/ApplicationSchema#>
PREFIX geo: <http://www.opengis.net/ont/geosparql#>
PREFIX geof: <http://www.opengis.net/def/function/geosparql/>

SELECT ?f
WHERE { { # check for asserted statement
          ?f geo:sfOverlaps my:A } 
        UNION
        { # feature – feature
          ?f geo:hasDefaultGeometry ?fGeom . 
          ?fGeom geo:asWKT ?fSerial .
          my:A geo:hasDefaultGeometry ?aGeom .
          ?aGeom geo:asWKT ?aSerial .
          FILTER (geof:sfOverlaps(?fSerial, ?aSerial)) } 
        UNION
        { # feature – geometry
          ?f geo:hasDefaultGeometry ?fGeom .
          ?fGeom geo:asWKT ?fSerial .
          my:A geo:asWKT ?aSerial .
          FILTER (geof:sfOverlaps(?fSerial, ?aSerial)) }
        UNION
        { # geometry – feature
          ?f geo:asWKT ?fSerial .
          my:A geo:hasDefaultGeometry ?aGeom .
          ?aGeom geo:asWKT ?aSerial .
          FILTER (geof:sfOverlaps(?fSerial, ?aSerial)) }
        UNION
        { # geometry – geometry
          ?f geo:hasDefaultGeometry ?fGeom . 
          ?fGeom geo:asWKT ?fSerial .
          my:A geo:hasDefaultGeometry ?aGeom . 
          ?aGeom geo:asWKT ?aSerial .
          FILTER (geof:sfOverlaps(?fSerial, ?aSerial)) } 
}
```

*Result*:
|===
|*?f*

|`my:D`
|`my:DExactGeom`
|`my:E`
|`my:EExactGeom`
|===
